{"format": "keras", "nodes": [{"name": "input_3", "id": "input_3", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "sequential_2", "id": "sequential_2", "class_name": "Sequential", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "conv2d_12", "id": "conv2d_12", "class_name": "Conv2D", "output_shape": [null, 256, 256, 128], "num_parameters": 3584}, {"name": "conv2d_13", "id": "conv2d_13", "class_name": "Conv2D", "output_shape": [null, 256, 256, 128], "num_parameters": 147584}, {"name": "max_pooling2d_6", "id": "max_pooling2d_6", "class_name": "MaxPooling2D", "output_shape": [null, 128, 128, 128], "num_parameters": 0}, {"name": "batch_normalization_6", "id": "batch_normalization_6", "class_name": "BatchNormalization", "output_shape": [null, 128, 128, 128], "num_parameters": 512}, {"name": "dropout_8", "id": "dropout_8", "class_name": "Dropout", "output_shape": [null, 128, 128, 128], "num_parameters": 0}, {"name": "conv2d_14", "id": "conv2d_14", "class_name": "Conv2D", "output_shape": [null, 128, 128, 128], "num_parameters": 147584}, {"name": "conv2d_15", "id": "conv2d_15", "class_name": "Conv2D", "output_shape": [null, 128, 128, 128], "num_parameters": 147584}, {"name": "max_pooling2d_7", "id": "max_pooling2d_7", "class_name": "MaxPooling2D", "output_shape": [null, 64, 64, 128], "num_parameters": 0}, {"name": "batch_normalization_7", "id": "batch_normalization_7", "class_name": "BatchNormalization", "output_shape": [null, 64, 64, 128], "num_parameters": 512}, {"name": "dropout_9", "id": "dropout_9", "class_name": "Dropout", "output_shape": [null, 64, 64, 128], "num_parameters": 0}, {"name": "conv2d_16", "id": "conv2d_16", "class_name": "Conv2D", "output_shape": [null, 64, 64, 128], "num_parameters": 147584}, {"name": "conv2d_17", "id": "conv2d_17", "class_name": "Conv2D", "output_shape": [null, 64, 64, 128], "num_parameters": 147584}, {"name": "max_pooling2d_8", "id": "max_pooling2d_8", "class_name": "MaxPooling2D", "output_shape": [null, 32, 32, 128], "num_parameters": 0}, {"name": "batch_normalization_8", "id": "batch_normalization_8", "class_name": "BatchNormalization", "output_shape": [null, 32, 32, 128], "num_parameters": 512}, {"name": "dropout_10", "id": "dropout_10", "class_name": "Dropout", "output_shape": [null, 32, 32, 128], "num_parameters": 0}, {"name": "global_average_pooling2d_2", "id": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_8", "id": "dense_8", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 16512}, {"name": "dense_9", "id": "dense_9", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 16512}, {"name": "dense_10", "id": "dense_10", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 16512}, {"name": "dropout_11", "id": "dropout_11", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_11", "id": "dense_11", "class_name": "Dense", "output_shape": [null, 2], "num_parameters": 258}], "edges": [["input_3", "sequential_2"], ["sequential_2", "conv2d_12"], ["conv2d_12", "conv2d_13"], ["conv2d_13", "max_pooling2d_6"], ["max_pooling2d_6", "batch_normalization_6"], ["batch_normalization_6", "dropout_8"], ["dropout_8", "conv2d_14"], ["conv2d_14", "conv2d_15"], ["conv2d_15", "max_pooling2d_7"], ["max_pooling2d_7", "batch_normalization_7"], ["batch_normalization_7", "dropout_9"], ["dropout_9", "conv2d_16"], ["conv2d_16", "conv2d_17"], ["conv2d_17", "max_pooling2d_8"], ["max_pooling2d_8", "batch_normalization_8"], ["batch_normalization_8", "dropout_10"], ["dropout_10", "global_average_pooling2d_2"], ["global_average_pooling2d_2", "dense_8"], ["dense_8", "dense_9"], ["dense_9", "dense_10"], ["dense_10", "dropout_11"], ["dropout_11", "dense_11"]]}